In [35]:
import pandas as pd
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}
df = pd.DataFrame(data)

In [36]:
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

In [37]:
df

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

In [6]:
df['Address'] = address

In [7]:
df

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [8]:
df.insert(2, "Age", [21, 23, 24, 21], True)

In [9]:
df

     Name  Height  Age Qualification    Address
0     Jai     5.1   21           Msc      Delhi
1  Princi     6.2   23            MA  Bangalore
2  Gaurav     5.1   24           Msc    Chennai
3    Anuj     5.2   21           Msc      Patna

In [10]:
df2 = df.assign(address=['Delhi', 'Bangalore', 'Chennai', 'Patna'])

In [11]:
df2

     Name  Height  Age Qualification    Address    address
0     Jai     5.1   21           Msc      Delhi      Delhi
1  Princi     6.2   23            MA  Bangalore  Bangalore
2  Gaurav     5.1   24           Msc    Chennai    Chennai
3    Anuj     5.2   21           Msc      Patna      Patna

In [59]:
for row in df.values:
    if row[1] == 'Jai':
        #print(row[1])
        df2 = df.replace('Jai', '1')

In [60]:
df2

   new2    Name  Height  new  test Qualification
0     1       1     5.1    1     1           Msc
1     2  Princi     6.2    2     2            MA
2     3  Gaurav     5.1    3     3           Msc
3     4    Anuj     5.2    4     4           Msc